app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."posts_id" IN ($1, $2, $3, $4)  [["posts_id", 585], ["posts_id", 586], ["posts_id", 587], ["posts_id", 588]]
---
      <% unless @posts.empty? %>
        <% @posts.includes(:comments).each do |post| %>