app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."posts_id" = $1  [["posts_id", 3]]
---
      <ul>
        <% @post.comments.each do |comment| %>