app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "created_at", "updated_at", "posts_id", "users_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "sasssas"], ["created_at", "2023-09-30 07:43:04.647710"], ["updated_at", "2023-09-30 07:43:04.647710"], ["posts_id", 3], ["users_id", 2]]
---
  def create
    @comment = Comment.new(comment_params)
    @post = Post.find(params[:post_id])
    @comment.users_id = current_user.id
    @comment.posts_id = @post.id

    if @comment.save