app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @like = @post.likes.new(users_id: current_user.id, posts_id: @post)
    if @like.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "users_id", "posts_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2023-09-30 07:52:24.821673"], ["updated_at", "2023-09-30 07:52:24.821673"], ["users_id", 2], ["posts_id", 3]]