app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."posts_id" IN ($1, $2, $3, $4)  [["posts_id", 585], ["posts_id", 586], ["posts_id", 587], ["posts_id", 588]]
---
  def index
    @user = User.find(params[:user_id])
    @posts = @user.posts.includes(:comments)

INSERT INTO "posts" ("title", "text", "comments_counter", "likes_counter", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "www"], ["text", "wwww"], ["comments_counter", 0], ["likes_counter", 0], ["author_id", 2], ["created_at", "2023-09-30 11:34:36.638982"], ["updated_at", "2023-09-30 11:34:36.638982"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save