app/models/post.rb

UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 2], ["updated_at", "2023-09-30 07:52:24.841252"], ["id", 3]]
UPDATE "users" SET "posts_counter" = COALESCE("posts_counter", 0) + $1 WHERE "users"."id" = $2  [["posts_counter", 1], ["id", 2]]
---
  def update_user_posts_counter
    user.increment!(:posts_count)